my_99_cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2018-10-18"], ["color", "Green"], ["name", "Cat"], ["sex", "F"], ["text", "cat"], ["created_at", "2018-10-16 20:11:54.513610"], ["updated_at", "2018-10-16 20:11:54.513610"]]

  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "text" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Black"], ["text", "cas"], ["updated_at", "2018-10-16 21:10:53.237560"], ["id", 10]]